
const state = () => ({
    hotartis:[
        {
            author:'妖十三',
            arti_id:'27WJUDL6',
            au_head:'img/japan01.jpeg',
            time:'2016年10月3日16:57',
            time_val:20161003,
            a_word:'葡萄牙不仅有C罗，还有大航海和美食——西葡自由行之里斯本篇',
            dis_img:['img/course13.jpeg','img/course14.jpeg'],
            all_word:`<img src="img/course13.jpeg" alt="">
                            1、TIPS
                            城市印象                 
                            作为葡萄牙的首都，里斯本的破败和萧条在刚到的时候真的很打击我。但慢慢的又被其他东西治愈，比如没零钱时让我们不用买票的司机，各种看见我们有困难上来帮助的热心人，以及，好吃到让人心碎的蛋挞。       
                            说城市景观，里斯本完全没有想象中欧洲城市的漂亮，反而显得有些衰败。相比西班牙的那几个城市，会感觉更嬉皮、更街头一点。由于城市真的很小，很多东西都很Q很萌。比如下面这俩，一个类似我们的“摩的”，一个是卖冰淇淋的小车，都是萌死人不偿命。
                            <br/><br/>人种<br/><br/>                
                            两牙虽隔得近，但人长得很不像，可能因为大航海的缘故，里斯本人种更混杂一点，肤色也相对偏深。要说人种混杂混血儿应该漂亮吧，但里斯本的人真算混得比较失败的（仅就个人观感而言，绝对没有恶意）。所以，C罗在葡萄牙真的算很帅的了！ 
                            相较西班牙街头那些乖乖少年，这边的年轻人看上去要“痞”一点。当然，只是看上去，实际上他们非常友善，我们在车站搞不清楚买那种票时，就有一个像刚从夜店磕完药出来的小青年主动上来帮助我们，虽然他的英语烂得要死，但人很nice。
                             <br/>
                            <br/>
                            语言
                            <br/><br/>
                            同样可能因为大航海的缘故，这里很早就有和外界交流的传统，所以葡萄牙人的英语普遍比西班牙好，而且大多说得很标准，完全不用担心交流问题。
                            交通
                            首先要说明的是，里斯本和重庆很像，是一座建在山上的城市，那真叫一个爬高上低。而且有各种眼花缭乱的单行线，想来自驾的朋友，最好打消这个念头。
                            <img src="img/course14.jpeg" alt=""></img>`
        },{
            author:'妖十三',
            arti_id:'0P983JUS',
            au_head:'img/japan01.jpeg',
            time:'2017年11月13日16:57',
            time_val:20171113,
            a_word:'翘掉了一节课，踏上了开往厦门的动车。 ',
            dis_img:['img/course13.jpeg','img/course14.jpeg'],
            all_word: `关于游玩,讲真，我们在厦门玩了两天，却也只晃悠了两个地方：中山路，和鼓浪屿。五一过后，游客很少，加上天气十分晴朗，哪里都是干干净净的，
                        一尘不染的地面，和一尘不染的天空。
                        走到这里，阶梯式的建筑让人仿佛置身于欧洲地中海海岸，粉色和乳白色相间的外墙，在天空的衬映下，显得十分清新。 中山路是一个闲逛的好地方，
                        这里不仅可以买到各式各样的伴手礼，同时还能感受到些许市井气息，商业化与接地气并存的最佳状态。`
        },{
            author:'会飞的小象',
            arti_id:'W076HYTR',
            au_head:'img/japan02.jpg',
            time:'2019年10月3日16:57',
            time_val:20191003,
            a_word:'浅草寺求签，希望未来一切安好',
            dis_img:['img/course13.jpeg','img/course14.jpeg'],
            all_word:`2016年下半年过得不太开心，工作到了瓶颈期，生活上也没什么热情，对未来的何去何从充满了迷茫。尽管自己平时最擅长熬心灵鸡汤，但到了自己还是心里一片乱。决定好好休息一段时间，规整一下自我，也重新考虑是不是应该趁着年轻去找一份真正喜欢的工作。2017年3月的日本行算是一个中转点，不是说一场旅行便是给心灵一场洗礼，我想给心灵深度放松一下。
            至于为什么选择日本，最直白的理由是，我想去买买买！平时不追日剧，除了热爱日本护肤品以外似乎没什么其他的兴趣，但家里有长辈经常往返日本，听他形容日本一尘不染，天湛蓝无云，水果甘甜可口，人们热情而礼貌，恩，我很想去感受一番。
            老规矩，先请大家欣赏一波预告图<img src="img/course13.jpeg" alt="">`
        },{
            author:'会飞的小象',
            arti_id:'90PMWUY6',
            au_head:'img/japan02.jpg',
            time:'2019年11月04日16:57',
            time_val:20191104,
            a_word:'像水晶一般宝蓝色的湖面上划过一艘蓝白相间的游艇',
            dis_img:['img/course13.jpeg','img/course14.jpeg'],
            all_word: `所有人来到这里，时刻挂着喜悦、惊奇的表情，个个都像孩子。
            偶遇的美国大叔组合：「这里是我们回顾青春的地方」
             很多时候，让直觉做决定比较好。比如这次利用没课的周四周五+双休日，拼凑出四天的假期，拽上小伙伴，一起奔向冰岛。在各种相册里意淫了太久的地方，
            摄于南海岸黑沙滩
            下定决心的过程走的是心，却不一定是大脑。我们看着四位数的机票，又 翻回达人游记和攻略，咽咽口水，认真地按了“Pay now”。  
            冬日的夜晚，陷入冰蓝色的城市
             不知几时在杂志上看到了一张航拍照片。像水晶一般宝蓝色的湖面上划过一艘蓝白相间的游艇，身后拖着长而曲折的痕迹。感觉这是一片带着神秘感的缥缈土地，是一片鲜有人烟的人间仙境。    
            冬日来到这里，随处有惊喜
             当然事实并非如此。冰岛是一个人口32万的独立国家，拥有发达的能源和冶金工业。这样看它不过幅员10.3万平方公里，但它总让人觉得特别。也许是因为它孤身一人坐落在广阔的北大西洋上，也许是因为它被冰雪覆盖的大片国土给人以纯净的遐想。   
            我们乘坐的大巴车 
            飞机上凝望
            彻底忘掉钱包出血的惨相，把自己塞进加绒保暖衣裤里背起行囊。在一个没有公交车的国家，学生狗最实惠的选择无非是参团游岛。虽然一定程度上限制了游览范围，却是在短时间内饱览岛上风光的最佳方式。
            欧洲超市里的酸奶琳琅满目
             来到欧美国家就必须不能错过满货架满货架的酸奶。从热情果到板栗核桃纷纷试个遍吧，就算是不太习惯的味道，也全因这份陌生带来的新奇而令人振奋。
             蓝泻湖（Blue Lagoon）也叫蓝湖，位于冰岛西南部雷克雅尼斯半岛的格林达维克，距离凯夫拉维克机场（KEF）仅13公里。乘坐RF旅游公司的巴士，40分钟就能到达景区。所以一下飞机就去蓝湖，是充分利用时间的最佳选择。
            摄于蓝湖入口外
             蓝湖由部分火山熔岩形成，水温大概37-39℃。湖中间位置有一不停向外喷涌热水的泉眼，那里至少达到50℃。温泉池里最常见的景象，就是一股喷出的热水，腾起浓烈的硫磺味蒸汽，把人们团团围住。你我相距不到半米，相见不知正相视
            不用担心安全问题
             水底的石头凹凸不平，有的地方只有齐腰深，有的地方必须猛踮脚尖才能勉强够到湖底，有的地方却浅到必须以极丑的姿势扎马步前进，才能保证脖子以下都浸在水里。
            下楼梯要小心呦
             蓝湖正位于一座死火山上，故地层中有益的矿物质沉积在湖底，形成了火山泥，游客可以用勺子舀来敷在各个地方。老外们都很high地涂得满身都是，然后装成一尊尊裸体雕塑自拍。
            火山泥，取之不尽的涂抹式面膜
             要想把蓝湖拍出好像杂志上一般的水蓝色，就必须等到云朵把天空遮起来的阴天才可以哦。正巧赶上一个好天气，我们拍出来的湖水都是白色的（于是每次都要苦苦等云飘过来）。
            海水流经地下火山熔岩层而吸收热量，水中含有大量矿物质，被证明有舒神经压力的疗效；这也是各种从蓝湖提炼的产品大卖的原因。`
    },{
        author:'打怪班长',
        arti_id:'QMYSY6W5',
        au_head:'img/txt1.jpeg',
        time:'2017年2月20日16:57',
        time_val:20170220,
        a_word:'在北欧生活|跟着芬兰人去冰钓！',
        dis_img:['img/01.jpeg'],
        all_word: `一个冰钻，一个筛子,一把简易的鱼竿,鱼饵，还有一把小椅子,就向结成厚厚冰层的湖面出发了,在风雪中一坐往往就是好几个小时文章版权归作者所有，任何形式转载请联系作者。
        那天在湖上打了有十多个洞吧
        可是芬兰小哥却越打越起劲
        硬是要找到一个能钓到鱼的地方
        此刻我和另一个中国小伙伴已经冷得直哆嗦
        我问芬兰人：“这是不是就叫芬兰人的Sisu精神？”
        他回答说：“就算到最后一刻都不会放弃”
        <img src="img/fl01.jpeg" alt="">
        `
},{
    author:'打怪班长',
    arti_id:'WI09OL75',
    au_head:'img/txt1.jpeg',
    time:'2017年4月20日16:57',
    time_val:20170420,
    a_word:'我有一家海鸥食堂，你有故事吗？',
    dis_img:['img/fl01.jpeg'],
    all_word: `大地回暖，想在安静又随性的海鸥食堂坐下，享受微醺的阳光，轻啜醇香的咖啡，聆听大家的故事。
    芬兰有一家咖啡馆：Ravitola KAMOME，因2006年播出的治愈系电影《海鸥食堂》走红。打开它的官网，除了一阵阵的海鸥鸣叫，还有那位常来喝免费咖啡的自行车少年，那群常在店外观看议论的路人都是那样的熟悉。
    “固执”的店主幸惠不顾一个多月无人光顾的冷清，要将日本饭团作为主菜单吸引芬兰客人，因为每年远足与运动会的时候，不擅厨艺的父亲总是给她做饭团，里面含着梅干、鲑鱼、鲣鱼的日式饭团。被芬兰的趣味比赛空气吉他吸引过来的正子，亦是被芬兰的这份平静安定所吸引。问及芬兰人原因，他们说因为他们有森林，正子便义无反顾的来了趟森林之旅。
    海鸥食堂的第一个客人是位爱骑单车、喜欢日本文化的青年，他拥有喝免费咖啡的特权，每日都会来海鸥食堂小憩。单纯的青年碰上怕食堂倒闭的小绿，没有大声的争吵，只有转弯抹角的提示。
    还有那位在食堂外面带着愤怒的面孔站了几天的夫人，进店便要了一杯酒，然后倒下，之后她们成了好友。
    <img src="img/fl01.jpeg" alt="">
    `
},{
    author:'打怪班长',
    arti_id:'XMSUYW63',
    au_head:'img/txt1.jpeg',
    time:'2017年4月20日16:57',
    time_val:20170420,
    a_word:'有幸在泰国最舒适的季节光顾这座别致的王国',
    dis_img:['img/taiguo01.jpeg','img/taiguo02.jpeg'],
    all_word: `住在清迈的BED酒店里。那是一个十分具有设计感的酒店，走现代风格。文章版权归作者所有，任何形式转载请联系作者。
    (从餐厅望向酒店内部)
    酒店24小时水果，咖啡和矿泉水免费供应，而清迈物价真的十分便宜，酒店大约400软妹币一晚。文章版权归作者所有，任何形式转载请联系作者。
    (免费无限量供应的咖啡和小食)
    清迈最有趣的活动便是逛周日夜市了。
    <img src="img/taiguo01.jpeg" alt="">
    再强调一次，物价真的很便宜，再加上政府夜市限价，可以淘到许多琳琅满目的小东西。就算人可多了，也很开心。
    (有很好看的手工本子，折下来软妹币只要20)
    还有很好看很好看的书签，忘了具体多少钱了🙃但是记得也很实惠，一口气买了许多。`
},{
    author:'打怪班长',
    arti_id:'YUS653MU',

    au_head:'img/txt1.jpeg',
    time:'2017年4月20日16:57',
    time_val:20170420,
    a_word:'上一篇豆丁儿在清迈浪,今天写在曼谷浪！！',
    dis_img:['img/taiguo01.jpeg','img/taiguo02.jpeg'],
    all_word: `
    (曼谷的地铁站)
    和上海的地铁不同之处在于它的椅子很长很长一条，可以坐二三十个人，可热闹了
    (有点糊了的地铁票)
    这个是地铁票🌚
    圆形的超容易搞丢🙃晚上在酒店楼下吃了一点当地的食物
    
    泰国的虾和预想的一样好吃，q弹而新鲜！晚上十点多吃饭食材质量也丝毫不受影响！
    <img src="img/taiguo02.jpeg" alt="">
    春卷是随口点的，没想到居然那么好吃🎉
    
    特别脆，白菜粉丝馅儿，回味十足
    第二天我们去了大皇宫。中国的游客们去泰国的必玩之处🙃
    
    人很多，豆丁很努力的拍了些没啥人的照片。
    (大皇宫)
    真的很漂亮！还是值得一去的。
    但是很气的是我们去的很不巧，室内的展馆许多都没有开，大皇宫赠送的另一个公园的门票也浪费了(以后再去吧
        上图很适合看夕阳！据说搭配着红色圣光美的不行！可是我们没机会等到那么晚了😣
        下一天我们去了安帕瓦水上市场！
        很著名的水上市场，进场出现在泰剧中🙃文章版权归作者所有，任何形式转载请联系作者。
        这个地方不用说人也是超级多！
        但是东西却出乎意料的不算很贵，毕竟算是旅游胜地🤔
很幸运虽然在清迈没吃到mango tango
曼谷却碰到了一家人很少的店
尝了鲜拔了草    
`
},]

   })
   
   const mutations = {
     add(state, text) {
         state.hotartis.push(text)
       }
   }
   
   const actions = {
       add:({commit},text) =>{
           commit('add',text)
       }
   }
   
   export default {
       namespaced: true,
       state,
       mutations,
       actions
   }