const state = () => ({
    city:
    [{"province":"北京市","cities":[
        {"name":"市辖区","id":"110100"}
    
    ]},{"province":"天津市","cities":[
        {"name":"市辖区","id":"120100"}
    ]},{"province":"河北省","cities":[
        {"name":"石家庄市","id":"130100"},{"name":"唐山市","id":"130200"},{"name":"秦皇岛市","id":"130300"},{"name":"邯郸市","id":"130400"},{"name":"邢台市","id":"130500"},{"name":"保定市","id":"130600"},{"name":"张家口市","id":"130700"},{"name":"承德市","id":"130800"},{"name":"沧州市","id":"130900"},{"name":"廊坊市","id":"131000"},{"name":"衡水市","id":"131100"},{"name":"省直辖县级行政区划","id":"139000"}
    ]},{"province":"山西省","cities":[
        {"name":"太原市","id":"140100"},{"name":"大同市","id":"140200"},{"name":"阳泉市","id":"140300"},{"name":"长治市","id":"140400"},{"name":"晋城市","id":"140500"},{"name":"朔州市","id":"140600"},{"name":"晋中市","id":"140700"},{"name":"运城市","id":"140800"},{"name":"忻州市","id":"140900"},{"name":"临汾市","id":"141000"},{"name":"吕梁市","id":"141100"}
    
    ]},{"province":"上海市","cities":[
        {"name":"市辖区","id":"310100"}
    
    ]},{"province":"吉林省","cities":[
        {"name":"长春市","id":"220100"},{"name":"吉林市","id":"220200"},{"name":"四平市","id":"220300"},{"name":"辽源市","id":"220400"},{"name":"通化市","id":"220500"},{"name":"白山市","id":"220600"},{"name":"松原市","id":"220700"},{"name":"白城市","id":"220800"},{"name":"延边朝鲜族自治州","id":"222400"}
    
    ]},{"province":"黑龙江省","cities":[
        {"name":"哈尔滨市","id":"230100"},{"name":"齐齐哈尔市","id":"230200"},{"name":"鸡西市","id":"230300"},{"name":"鹤岗市","id":"230400"},{"name":"双鸭山市","id":"230500"},{"name":"大庆市","id":"230600"},{"name":"伊春市","id":"230700"},{"name":"佳木斯市","id":"230800"},{"name":"七台河市","id":"230900"},{"name":"牡丹江市","id":"231000"},{"name":"黑河市","id":"231100"},{"name":"绥化市","id":"231200"},{"name":"大兴安岭地区","id":"232700"}
    
    ]},{"province":"浙江省","cities":[
        {"name":"杭州市","id":"330100"},{"name":"宁波市","id":"330200"},{"name":"温州市","id":"330300"},{"name":"嘉兴市","id":"330400"},{"name":"湖州市","id":"330500"},{"name":"绍兴市","id":"330600"},{"name":"金华市","id":"330700"},{"name":"衢州市","id":"330800"},{"name":"舟山市","id":"330900"},{"name":"台州市","id":"331000"},{"name":"丽水市","id":"331100"}
    
    ]},{"province":"江西省","cities":[
        {"name":"南昌市","id":"360100"},{"name":"景德镇市","id":"360200"},{"name":"萍乡市","id":"360300"},{"name":"九江市","id":"360400"},{"name":"新余市","id":"360500"},{"name":"鹰潭市","id":"360600"},{"name":"赣州市","id":"360700"},{"name":"吉安市","id":"360800"},{"name":"宜春市","id":"360900"},{"name":"抚州市","id":"361000"},{"name":"上饶市","id":"361100"}
    
    ]},{"province":"辽宁省","cities":[
        {"name":"沈阳市","id":"210100"},{"name":"大连市","id":"210200"},{"name":"鞍山市","id":"210300"},{"name":"抚顺市","id":"210400"},{"name":"本溪市","id":"210500"},{"name":"丹东市","id":"210600"},{"name":"锦州市","id":"210700"},{"name":"营口市","id":"210800"},{"name":"阜新市","id":"210900"},{"name":"辽阳市","id":"211000"},{"name":"盘锦市","id":"211100"},{"name":"铁岭市","id":"211200"},{"name":"朝阳市","id":"211300"},{"name":"葫芦岛市","id":"211400"}
    
    ]},{"province":"江苏省","cities":[
        {"name":"南京市","id":"320100"},{"name":"无锡市","id":"320200"},{"name":"徐州市","id":"320300"},{"name":"常州市","id":"320400"},{"name":"苏州市","id":"320500"},{"name":"南通市","id":"320600"},{"name":"连云港市","id":"320700"},{"name":"淮安市","id":"320800"},{"name":"盐城市","id":"320900"},{"name":"扬州市","id":"321000"},{"name":"镇江市","id":"321100"},{"name":"泰州市","id":"321200"},{"name":"宿迁市","id":"321300"}
    
    ]},{"province":"河南省","cities":[
        {"name":"郑州市","id":"410100"},{"name":"开封市","id":"410200"},{"name":"洛阳市","id":"410300"},{"name":"平顶山市","id":"410400"},{"name":"安阳市","id":"410500"},{"name":"鹤壁市","id":"410600"},{"name":"新乡市","id":"410700"},{"name":"焦作市","id":"410800"},{"name":"濮阳市","id":"410900"},{"name":"许昌市","id":"411000"},{"name":"漯河市","id":"411100"},{"name":"三门峡市","id":"411200"},{"name":"南阳市","id":"411300"},{"name":"商丘市","id":"411400"},{"name":"信阳市","id":"411500"},{"name":"周口市","id":"411600"},{"name":"驻马店市","id":"411700"},{"name":"省直辖县级行政区划","id":"419000"}
    
    ]},{"province":"山东省","cities":[
        {"name":"济南市","id":"370100"},{"name":"青岛市","id":"370200"},{"name":"淄博市","id":"370300"},{"name":"枣庄市","id":"370400"},{"name":"东营市","id":"370500"},{"name":"烟台市","id":"370600"},{"name":"潍坊市","id":"370700"},{"name":"济宁市","id":"370800"},{"name":"泰安市","id":"370900"},{"name":"威海市","id":"371000"},{"name":"日照市","id":"371100"},{"name":"莱芜市","id":"371200"},{"name":"临沂市","id":"371300"},{"name":"德州市","id":"371400"},{"name":"聊城市","id":"371500"},{"name":"滨州市","id":"371600"},{"name":"菏泽市","id":"371700"}
    
    ]},{"province":"内蒙古自治区","cities":[
        {"name":"呼和浩特市","id":"150100"},{"name":"包头市","id":"150200"},{"name":"乌海市","id":"150300"},{"name":"赤峰市","id":"150400"},{"name":"通辽市","id":"150500"},{"name":"鄂尔多斯市","id":"150600"},{"name":"呼伦贝尔市","id":"150700"},{"name":"巴彦淖尔市","id":"150800"},{"name":"乌兰察布市","id":"150900"},{"name":"兴安盟","id":"152200"},{"name":"锡林郭勒盟","id":"152500"},{"name":"阿拉善盟","id":"152900"}
    
    ]},{"province":"湖北省","cities":[
        {"name":"武汉市","id":"420100"},{"name":"黄石市","id":"420200"},{"name":"十堰市","id":"420300"},{"name":"宜昌市","id":"420500"},{"name":"襄阳市","id":"420600"},{"name":"鄂州市","id":"420700"},{"name":"荆门市","id":"420800"},{"name":"孝感市","id":"420900"},{"name":"荆州市","id":"421000"},{"name":"黄冈市","id":"421100"},{"name":"咸宁市","id":"421200"},{"name":"随州市","id":"421300"},{"name":"恩施土家族苗族自治州","id":"422800"},{"name":"省直辖县级行政区划","id":"429000"}
    
    ]},{"province":"安徽省","cities":[
        {"name":"合肥市","id":"340100"},{"name":"芜湖市","id":"340200"},{"name":"蚌埠市","id":"340300"},{"name":"淮南市","id":"340400"},{"name":"马鞍山市","id":"340500"},{"name":"淮北市","id":"340600"},{"name":"铜陵市","id":"340700"},{"name":"安庆市","id":"340800"},{"name":"黄山市","id":"341000"},{"name":"滁州市","id":"341100"},{"name":"阜阳市","id":"341200"},{"name":"宿州市","id":"341300"},{"name":"六安市","id":"341500"},{"name":"亳州市","id":"341600"},{"name":"池州市","id":"341700"},{"name":"宣城市","id":"341800"}
    
    ]},{"province":"湖南省","cities":[
        {"name":"长沙市","id":"430100"},{"name":"株洲市","id":"430200"},{"name":"湘潭市","id":"430300"},{"name":"衡阳市","id":"430400"},{"name":"邵阳市","id":"430500"},{"name":"岳阳市","id":"430600"},{"name":"常德市","id":"430700"},{"name":"张家界市","id":"430800"},{"name":"益阳市","id":"430900"},{"name":"郴州市","id":"431000"},{"name":"永州市","id":"431100"},{"name":"怀化市","id":"431200"},{"name":"娄底市","id":"431300"},{"name":"湘西土家族苗族自治州","id":"433100"}
    
    ]},{"province":"福建省","cities":[
        {"name":"福州市","id":"350100"},{"name":"厦门市","id":"350200"},{"name":"莆田市","id":"350300"},{"name":"三明市","id":"350400"},{"name":"泉州市","id":"350500"},{"name":"漳州市","id":"350600"},{"name":"南平市","id":"350700"},{"name":"龙岩市","id":"350800"},{"name":"宁德市","id":"350900"}
    
    ]},{"province":"广西壮族自治区","cities":[
        {"name":"南宁市","id":"450100"},{"name":"柳州市","id":"450200"},{"name":"桂林市","id":"450300"},{"name":"梧州市","id":"450400"},{"name":"北海市","id":"450500"},{"name":"防城港市","id":"450600"},{"name":"钦州市","id":"450700"},{"name":"贵港市","id":"450800"},{"name":"玉林市","id":"450900"},{"name":"百色市","id":"451000"},{"name":"贺州市","id":"451100"},{"name":"河池市","id":"451200"},{"name":"来宾市","id":"451300"},{"name":"崇左市","id":"451400"}
    
    ]},{"province":"广东省","cities":[
        {"name":"广州市","id":"440100"},{"name":"韶关市","id":"440200"},{"name":"深圳市","id":"440300"},{"name":"珠海市","id":"440400"},{"name":"汕头市","id":"440500"},{"name":"佛山市","id":"440600"},{"name":"江门市","id":"440700"},{"name":"湛江市","id":"440800"},{"name":"茂名市","id":"440900"},{"name":"肇庆市","id":"441200"},{"name":"惠州市","id":"441300"},{"name":"梅州市","id":"441400"},{"name":"汕尾市","id":"441500"},{"name":"河源市","id":"441600"},{"name":"阳江市","id":"441700"},{"name":"清远市","id":"441800"},{"name":"东莞市","id":"441900"},{"name":"中山市","id":"442000"},{"name":"潮州市","id":"445100"},{"name":"揭阳市","id":"445200"},{"name":"云浮市","id":"445300"}
    ]}]
    
    
    
    
    
   })
   
   const mutations = {
     add(state, text) {
         state.city.push(text)
       }
   }
   
   const actions = {
       add:({commit},text) =>{
           commit('add',text)
       }
   }
   
   export default {
       namespaced: true,
       state,
       mutations,
       actions
   }